from collections import defaultdict

myarray = ['あお','あか','あきな','あき','あざむ','あざ','あじ','あず','あせ','あそ','あたた','あたら','あた','あつか','あつ','あなど','あば','あぶ','あま','あやつ','あやま','あや','あゆ','あらそ','あらた','あらわ','あら','ある','あわ','あ','いか','いきお','いきどお','いこ','いさぎよ','いさ','いそが','いそ','いただ','いた','いだ','いちじる','いつく','いつわ','いつ','いとな','いど','いの','いまし','いや','いろど','いわ','い','うかが','うけたまわ','うご','うしな','うし','うす','うたが','うた','うた','うった','うつく','うつ','うと','うなが','うば','うやうや','うやま','うらな','うらや','うら','うるお','うるわ','うる','うれ','う','えが','えら','え','おお','おか','おが','おぎな','おく','おこた','おこな','おこ','おごそ','おさな','おさ','おし','おそ','おそ','おそ','おだ','おちい','おとしい','おとず','おとろ','おと','おどろ','おど','おな','おびや','おぼ','おもむ','おも','およ','おろ','お','かえり','かえ','かお','かか','かがや','かぎ','かく','かげ','かこ','かさ','かざ','かしこ','かせ','かぞ','かたむ','かたよ','かたわ','かた','かつ','かなら','かな','かな','かま','かも','かよ','から','かる','かろ','かわ','かんが','かんば','か','きざ','きざ','きず','きそ','きたな','きた','きた','きび','きよ','きら','きわ','き','くさ','くさ','くず','くだ','くだ','くつがえ','くば','くも','くや','くら','くる','くろ','くわだ','くわ','くわ','く','けが','けず','けむ','けわ','け','こい','こうむ','こお','ここの','こころざ','こころよ','こころ','こご','こた','こた','ことわ','この','こば','こま','ころ','こわ','こ','さいわ','さえぎ','さか','さぐ','さけ','ささ','さず','さそ','さだ','さと','さと','さば','さび','さまた','さむ','さわ','さわ','さわ','さ','しあわ','しいた','しげ','しず','しず','しず','したが','したた','した','した','しの','しば','しぶ','しぼ','しぼ','しめ','しめ','しら','しりぞ','しる','しろ','し','すく','すぐ','すこ','すす','すず','すた','すで','すべ','すみ','するど','すわ','す','せば','せま','せ','そこ','そそのか','そそ','そだ','そな','そな','そむ','そ','たい','たお','たか','たがや','たが','たくわ','たく','たぐ','たし','たす','たずさ','たず','たたか','たた','ただよ','ただ','たっと','たてまつ','たと','たの','たまわ','ため','たも','たよ','たよ','たわむ','た','だま','だ','だ','ちい','ちか','ちか','ちが','ちぎ','ちぢ','ち','つい','つくろ','つく','つぐな','つたな','つた','つちか','つつし','つつ','つづ','つと','つど','つの','つむ','つめ','つよ','つらぬ','つら','つ','て','で','とうと','とお','とお','とつ','ととの','とどこお','とど','とな','とな','とぼ','とむら','ともな','と','なお','なか','なが','なぐさ','なぐ','なげ','なご','なさ','なつ','なな','なな','なま','なめ','なや','なら','な','にお','にが','にぎ','にく','にご','にな','にぶ','に','ぬす','ぬ','ねが','ねば','ねむ','ねんご','ね','ね','のが','のこ','のぞ','のぞ','のぞ','のぼ','の','はい','はか','はぐく','はげ','はげ','はこ','はさ','はし','はじ','はじ','はずかし','はず','はず','はたら','はなは','はな','はば','はぶ','はや','はら','は','ひい','ひか','ひき','ひく','ひさ','ひそ','ひた','ひと','ひび','ひら','ひるがえ','ひろ','ひろ','ひ','ふか','ふく','ふせ','ふたた','ふた','ふと','ふる','ふ','へだ','へ','べ','ほうむ','ほう','ほが','ほこ','ほそ','ほっ','ほどこ','ほま','ほろ','ほ','まい','まかな','まか','まぎ','まさ','まじ','まず','またた','まった','まつ','まど','まな','まぬか','まね','まも','まよ','まる','まる','まわ','ま','みが','みじか','みじ','みずか','みだ','みちび','みっ','みつ','みと','みにく','みの','み','み','み','み','むか','むく','むす','むずか','むっ','む','む','む','む','めぐ','めぐ','めずら','め','もう','もう','もぐ','もち','もっと','もっぱ','もと','もど','もよお','も','やさ','やさ','やしな','やす','やっ','やと','やど','やぶ','やわ','や','ゆず','ゆた','ゆだ','ゆる','ゆ','よご','よそお','よっ','よろこ','よわ','よ','わか','わか','わざわ','わす','わずら','わた','わら','わる','わ']

# store all of the data values in an array

# create default dict, where the value is going to be an int
dupdict = defaultdict(int)

# we will iterate through every value in the array
for currentValue in myarray:

    # we will add into the duplicate dict, which handles does not exist errors
    dupdict[currentValue] += 1

# iterate through the map through key and value, and print out the duplicates
for index, value in dupdict.items():
    if value > 1:
        print(index, ' -- ', value)
